librbd_iscsi/yujiang/write/logs/fio-1m.fio.log
write-1m: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;write-1m;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;154554368;257565;251;600059;88;3166;324.620180;76.948468;6776;1825689;63283.590487;54822.575052;1.000000%=17694;5.000000%=25559;10.000000%=30801;20.000000%=38535;30.000000%=44826;40.000000%=50069;50.000000%=54788;60.000000%=60030;70.000000%=65798;80.000000%=73924;90.000000%=88604;95.000000%=108527;99.000000%=320864;99.500000%=459276;99.900000%=608174;99.950000%=658505;99.990000%=1602224;0%=0;0%=0;0%=0;7034;1825971;63608.210666;54824.078420;2052;420313;100.000000%;258231.883973;74087.264611;37.879505%;62.033670%;74358;0;641354;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.06%;1.71%;38.17%;53.68%;4.90%;1.12%;0.32%;0.02%;0.01%;0.00%;sda;0;18167;0;11863;0;266256;266760;1.12%;"write test with block size of 1m"

write-1m: (groupid=0, jobs=1): err= 0: pid=3271198: Thu May 21 06:35:26 2020
  Description  : ["write test with block size of 1m"]
  write: IOPS=251, BW=252MiB/s (264MB/s)(147GiB/600059msec)
    slat (usec): min=88, max=3166, avg=324.62, stdev=76.95
    clat (msec): min=6, max=1825, avg=63.28, stdev=54.82
     lat (msec): min=7, max=1825, avg=63.61, stdev=54.82
    clat percentiles (msec):
     |  1.00th=[   18],  5.00th=[   26], 10.00th=[   31], 20.00th=[   39],
     | 30.00th=[   45], 40.00th=[   51], 50.00th=[   55], 60.00th=[   61],
     | 70.00th=[   66], 80.00th=[   74], 90.00th=[   89], 95.00th=[  109],
     | 99.00th=[  321], 99.50th=[  460], 99.90th=[  609], 99.95th=[  659],
     | 99.99th=[ 1603]
   bw (  KiB/s): min= 2052, max=420313, per=100.00%, avg=258231.88, stdev=74087.26, samples=1198
   iops        : min=    2, max=  410, avg=252.11, stdev=72.36, samples=1198
  lat (msec)   : 10=0.06%, 20=1.71%, 50=38.17%, 100=53.68%, 250=4.90%
  lat (msec)   : 500=1.12%, 750=0.32%, 1000=0.02%, 2000=0.01%
  cpu          : usr=37.88%, sys=62.03%, ctx=74358, majf=0, minf=641354
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,150932,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=252MiB/s (264MB/s), 252MiB/s-252MiB/s (264MB/s-264MB/s), io=147GiB (158GB), run=600059-600059msec

Disk stats (read/write):
  sda: ios=0/18167, merge=0/11863, ticks=0/266256, in_queue=266760, util=1.12%