librbd_iscsi/yujiang/write/logs/fio-256k.fio.log
write-4k: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;write-4k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;53964800;89939;351;600010;20;335;67.820704;21.195659;2721;585501;45472.230088;30442.003596;1.000000%=5865;5.000000%=11730;10.000000%=16449;20.000000%=22937;30.000000%=28704;40.000000%=34340;50.000000%=40108;60.000000%=46399;70.000000%=53215;80.000000%=62652;90.000000%=79167;95.000000%=95944;99.000000%=141557;99.500000%=179306;99.900000%=320864;99.950000%=375390;99.990000%=480247;0%=0;0%=0;0%=0;2758;585598;45540.050792;30442.665812;8192;172032;100.000000%;90025.066667;19443.876599;34.121988%;65.806346%;90079;0;55838;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.15%;3.48%;11.58%;50.55%;29.97%;4.02%;0.24%;0.01%;0.00%;0.00%;0.00%;sda;0;21996;0;11810;0;260972;260964;1.12%;"write test with block size of 4k"

write-4k: (groupid=0, jobs=1): err= 0: pid=3525773: Thu May 21 08:41:26 2020
  Description  : ["write test with block size of 4k"]
  write: IOPS=351, BW=87.8MiB/s (92.1MB/s)(51.5GiB/600010msec)
    slat (usec): min=20, max=335, avg=67.82, stdev=21.20
    clat (msec): min=2, max=585, avg=45.47, stdev=30.44
     lat (msec): min=2, max=585, avg=45.54, stdev=30.44
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   12], 10.00th=[   17], 20.00th=[   23],
     | 30.00th=[   29], 40.00th=[   35], 50.00th=[   41], 60.00th=[   47],
     | 70.00th=[   54], 80.00th=[   63], 90.00th=[   80], 95.00th=[   96],
     | 99.00th=[  142], 99.50th=[  180], 99.90th=[  321], 99.95th=[  376],
     | 99.99th=[  481]
   bw (  KiB/s): min= 8192, max=172032, per=100.00%, avg=90025.07, stdev=19443.88, samples=1200
   iops        : min=   32, max=  672, avg=351.60, stdev=75.93, samples=1200
  lat (msec)   : 4=0.15%, 10=3.48%, 20=11.58%, 50=50.55%, 100=29.97%
  lat (msec)   : 250=4.02%, 500=0.24%, 750=0.01%
  cpu          : usr=34.12%, sys=65.81%, ctx=90079, majf=0, minf=55838
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,210800,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=87.8MiB/s (92.1MB/s), 87.8MiB/s-87.8MiB/s (92.1MB/s-92.1MB/s), io=51.5GiB (55.3GB), run=600010-600010msec

Disk stats (read/write):
  sda: ios=0/21996, merge=0/11810, ticks=0/260972, in_queue=260964, util=1.12%