librbd_iscsi/yujiang/write/logs/fio-4k.fio.log
write-4k: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;write-4k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;3074996;5124;1281;600002;1;184;4.465550;3.556023;1527;1002241;12482.658461;19328.143988;1.000000%=3293;5.000000%=5275;10.000000%=6651;20.000000%=7831;30.000000%=8454;40.000000%=9109;50.000000%=9633;60.000000%=10289;70.000000%=11075;80.000000%=13172;90.000000%=18481;95.000000%=21889;99.000000%=66846;99.500000%=116916;99.900000%=308281;99.950000%=371195;99.990000%=583008;0%=0;0%=0;0%=0;1532;1002246;12487.124011;19328.131833;40;7160;100.000000%;5137.905597;1679.290607;32.728279%;66.922388%;598087;0;937;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.11%;2.03%;53.93%;36.60%;6.07%;0.62%;0.51%;0.12%;0.02%;0.01%;0.01%;0.00%;sda;104;20687;0;12605;16;249872;249880;1.12%;"write test with block size of 4k"

write-4k: (groupid=0, jobs=1): err= 0: pid=3214139: Thu May 21 06:05:24 2020
  Description  : ["write test with block size of 4k"]
  write: IOPS=1281, BW=5125KiB/s (5248kB/s)(3003MiB/600002msec)
    slat (nsec): min=1038, max=184238, avg=4465.55, stdev=3556.02
    clat (usec): min=1527, max=1002.2k, avg=12482.66, stdev=19328.14
     lat (usec): min=1532, max=1002.2k, avg=12487.12, stdev=19328.13
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    6], 10.00th=[    7], 20.00th=[    8],
     | 30.00th=[    9], 40.00th=[   10], 50.00th=[   10], 60.00th=[   11],
     | 70.00th=[   12], 80.00th=[   14], 90.00th=[   19], 95.00th=[   22],
     | 99.00th=[   67], 99.50th=[  117], 99.90th=[  309], 99.95th=[  372],
     | 99.99th=[  584]
   bw (  KiB/s): min=   40, max= 7160, per=100.00%, avg=5137.91, stdev=1679.29, samples=1197
   iops        : min=   10, max= 1790, avg=1284.46, stdev=419.82, samples=1197
  lat (msec)   : 2=0.11%, 4=2.03%, 10=53.93%, 20=36.60%, 50=6.07%
  lat (msec)   : 100=0.62%, 250=0.51%, 500=0.12%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=32.73%, sys=66.92%, ctx=598087, majf=0, minf=937
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,768749,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=5125KiB/s (5248kB/s), 5125KiB/s-5125KiB/s (5248kB/s-5248kB/s), io=3003MiB (3149MB), run=600002-600002msec

Disk stats (read/write):
  sda: ios=104/20687, merge=0/12605, ticks=16/249872, in_queue=249880, util=1.12%