librbd_iscsi/yujiang/write/logs/fio-4m.fio.log
write-4m: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;write-4m;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;394080256;656719;160;600074;634;10884;1551.742275;700.761625;24357;1448431;98230.878994;60293.014226;1.000000%=35389;5.000000%=42205;10.000000%=47972;20.000000%=59506;30.000000%=69730;40.000000%=78118;50.000000%=87556;60.000000%=98041;70.000000%=109576;80.000000%=125304;90.000000%=147849;95.000000%=173015;99.000000%=358612;99.500000%=484442;99.900000%=650117;99.950000%=683671;99.990000%=1249902;0%=0;0%=0;0%=0;25583;1449585;99782.621269;60322.138524;8192;959348;100.000000%;658913.313283;147949.394287;44.802216%;54.788001%;46409;0;10283524;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;11.61%;50.41%;36.13%;1.43%;0.39%;0.02%;0.02%;0.00%;sda;0;21243;0;12404;0;221588;221584;1.01%;"write test with block size of 4m"

write-4m: (groupid=0, jobs=1): err= 0: pid=3292823: Thu May 21 06:45:27 2020
  Description  : ["write test with block size of 4m"]
  write: IOPS=160, BW=641MiB/s (672MB/s)(376GiB/600074msec)
    slat (usec): min=634, max=10884, avg=1551.74, stdev=700.76
    clat (msec): min=24, max=1448, avg=98.23, stdev=60.29
     lat (msec): min=25, max=1449, avg=99.78, stdev=60.32
    clat percentiles (msec):
     |  1.00th=[   36],  5.00th=[   43], 10.00th=[   48], 20.00th=[   60],
     | 30.00th=[   70], 40.00th=[   79], 50.00th=[   88], 60.00th=[   99],
     | 70.00th=[  110], 80.00th=[  126], 90.00th=[  148], 95.00th=[  174],
     | 99.00th=[  359], 99.50th=[  485], 99.90th=[  651], 99.95th=[  684],
     | 99.99th=[ 1250]
   bw (  KiB/s): min= 8192, max=959348, per=100.00%, avg=658913.31, stdev=147949.39, samples=1197
   iops        : min=    2, max=  234, avg=160.82, stdev=36.11, samples=1197
  lat (msec)   : 50=11.61%, 100=50.41%, 250=36.13%, 500=1.43%, 750=0.39%
  lat (msec)   : 1000=0.02%, 2000=0.02%
  cpu          : usr=44.80%, sys=54.79%, ctx=46409, majf=0, minf=10283524
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,96211,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=641MiB/s (672MB/s), 641MiB/s-641MiB/s (672MB/s-672MB/s), io=376GiB (404GB), run=600074-600074msec

Disk stats (read/write):
  sda: ios=0/21243, merge=0/12404, ticks=0/221588, in_queue=221584, util=1.01%