librbd_iscsi/yujiang/write/logs/fio-64k.fio.log
write-64k: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;write-64k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;21522752;35870;560;600020;5;383;18.083236;8.297745;2046;1628763;28528.292665;31954.484993;1.000000%=4751;5.000000%=7241;10.000000%=9502;20.000000%=12910;30.000000%=15269;40.000000%=17694;50.000000%=21102;60.000000%=25296;70.000000%=30277;80.000000%=38010;90.000000%=51118;95.000000%=69730;99.000000%=141557;99.500000%=162529;99.900000%=283115;99.950000%=541065;99.990000%=1182793;0%=0;0%=0;0%=0;2061;1628783;28546.375901;31954.560485;384;80000;100.000000%;36051.371548;14682.322197;33.113951%;66.729554%;217479;0;28622;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.41%;10.66%;36.09%;42.19%;8.04%;2.50%;0.06%;0.03%;0.01%;0.02%;0.00%;sda;0;18437;0;12507;0;255768;255744;1.14%;"write test with block size of 64k"

write-64k: (groupid=0, jobs=1): err= 0: pid=3251523: Thu May 21 06:25:25 2020
  Description  : ["write test with block size of 64k"]
  write: IOPS=560, BW=35.0MiB/s (36.7MB/s)(20.5GiB/600020msec)
    slat (usec): min=5, max=383, avg=18.08, stdev= 8.30
    clat (msec): min=2, max=1628, avg=28.53, stdev=31.95
     lat (msec): min=2, max=1628, avg=28.55, stdev=31.95
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    8], 10.00th=[   10], 20.00th=[   13],
     | 30.00th=[   16], 40.00th=[   18], 50.00th=[   22], 60.00th=[   26],
     | 70.00th=[   31], 80.00th=[   39], 90.00th=[   52], 95.00th=[   70],
     | 99.00th=[  142], 99.50th=[  163], 99.90th=[  284], 99.95th=[  542],
     | 99.99th=[ 1183]
   bw (  KiB/s): min=  384, max=80000, per=100.00%, avg=36051.37, stdev=14682.32, samples=1195
   iops        : min=    6, max= 1250, avg=563.23, stdev=229.43, samples=1195
  lat (msec)   : 4=0.41%, 10=10.66%, 20=36.09%, 50=42.19%, 100=8.04%
  lat (msec)   : 250=2.50%, 500=0.06%, 750=0.03%, 1000=0.01%, 2000=0.02%
  cpu          : usr=33.11%, sys=66.73%, ctx=217479, majf=0, minf=28622
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,336293,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=35.0MiB/s (36.7MB/s), 35.0MiB/s-35.0MiB/s (36.7MB/s-36.7MB/s), io=20.5GiB (22.0GB), run=600020-600020msec

Disk stats (read/write):
  sda: ios=0/18437, merge=0/12507, ticks=0/255768, in_queue=255744, util=1.14%